Template/T60_U0/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{

    leftWall
    {
        type            fixedValue;
        value           $internalField;
    }
    rightWall
    {
        type            fixedValue;
        value           $internalField;
    }
    topAndBottom
    {
        type            fixedValue;
        value           $internalField;
    }
    frontAndBack
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
